# Даны данные: n - количество строк в тексте, data - массив строк. Выведите все слова, встречающиеся в тексте, по одному на каждую строку. Слова должны быть отсортированы по убыванию их количества появления в тексте, а при одинаковой частоте появления — в лексикографическом порядке.
# Ответ подаётся в массиве строк, где строка - один ответ, очерёдность должна быть соблюдена, писать программу в функции run. Ответ отправляется с помощью return x, где x - ваш ответ.
class TaskFreqCheck:
    def __init__(self):
        self.name = "freq_check"

    def run(self, n, data):
        return None
