# Для настольной игры используются карточки с номерами от 1 до n. Одна карточка потерялась. Найдите ее, зная номера оставшихся карточек.
# Дано число n, далее n − 1 номер оставшихся карточек (различные числа от 1 до N). Программа должна вывести номер потерянной карточки.
# Ответ должен быть в формате int, писать в функции run. Ответ подаётся с помощью return x, где x - ваш ответ.
class TaskLostCard:
    def __init__(self):
        self.name = "card"

    def run(self, N, a):
        return None
